// let  fan1 = ['']
let  fan2= ["柯文哲","陳其邁","侯友宜", "盧秀燕"]
let  news = ["ETtoday新聞雲","中視新聞","PTT01 娛樂新聞","公視新聞網 PNN","東森新聞","蘋果新聞網","TVBS 新聞","新聞龍捲風"]
let  fan4 = ['ELLE',"頑童","BIGBANG","OZI","五月天","田馥甄","SHE","9m88","本色音樂","玖壹壹","BTS 防彈少年團"]
let school = ["中國科技大學",]
    "Sheet1": [
    {
        "地區": "台北",
        "職業": "行政秘書",
        "學校": "臺北市立大學",
        "粉絲專頁1": "臺北市立大學",
    },
    {
        "地區": "高雄",
        "職業": "攝影師",
        "學校": "高雄大學",
        "粉絲專頁1": "高雄大學",
    },
    {
        "地區": "新北",
        "職業": "牙醫助理",
        "學校": "華梵大學",
        "粉絲專頁1": "華梵大學",
    },
    {
        "地區": "台中",
        "職業": "公關經理",
        "學校": "中興大學",
        "粉絲專頁1": "中興大學",
    },
    {
        "地區": "台北",
        "職業": "銷售經理",
        "學校": "大同大學",
        "粉絲專頁1": "大同大學",
    },
    {
        "地區": "高雄",
        "職業": "打工族",
        "學校": "義守大學",
        "粉絲專頁1": "義守大學",
    },
    {
        "地區": "新北",
        "職業": "NHY 實習生",
        "學校": "明志科技大學",
        "粉絲專頁1": "明志科技大學",
    },
    {
        "地區": "台中",
        "職業": "客服人員",
        "學校": "逢甲大學",
        "粉絲專頁1": "逢甲大學",
    },
    {
        "地區": "台北",
        "職業": "業務人員",
        "學校": "文化大學",
        "粉絲專頁1": "文化大學",
    },
    {
        "地區": "高雄",
        "職業": "行銷企劃",
        "學校": "高雄大學",
        "粉絲專頁1": "高雄大學",
    },
    {
        "地區": "新北",
        "職業": "小資族",
        "學校": "華夏科技大學",
        "粉絲專頁1": "華夏科技大學",
    },
    {
        "地區": "台中",
        "職業": "工程師",
        "學校": "中興大學",
        "粉絲專頁1": "中興大學",
    },
    {
        "地區": "台北",
        "職業": "業務",
    },
    {
        "編號": "795",
        "手機號碼": "0902-250479",
        "姓名": "陳富火",
        "拼音": "Chen Fuhuo",
        "生日": "1986-06-07",
        "年紀": "34",
        "性別": "男",
        "帳號 (拼音+ 出生西元年份)": "chenfuhuo2000",
        "密碼(拼音第一位+生日4碼重複2次)": "c06070607",
        "大頭貼": "795",
        "封面照": "風景(74).jpg",
        "自我介紹": "Let it be",
        "地區": "高雄",
        "職業": "設計師",
        "學校": "高雄大學",
        "粉絲專頁1": "高雄大學",
    },
    {
        "編號": "796",
        "手機號碼": "0902-250480",
        "姓名": "楊任佩",
        "拼音": "Yang Renpei",
        "生日": "1995-10-30",
        "年紀": "27",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "yangrenpei1986",
        "密碼(拼音第一位+生日4碼重複2次)": "y10301030",
        "大頭貼": "796",
        "封面照": "風景(75).jpg",
        "自我介紹": "x",
        "地區": "新北",
        "職業": "助理",
        "學校": "醒吾科技大學",
        "粉絲專頁1": "醒吾科技大學",
    },
    {
        "編號": "797",
        "手機號碼": "0902-250483",
        "姓名": "洪耀智",
        "拼音": "Hong Yaozhi",
        "生日": "1992-04-27",
        "年紀": "28",
        "性別": "男",
        "帳號 (拼音+ 出生西元年份)": "hongyaozhi1992",
        "密碼(拼音第一位+生日4碼重複2次)": "h04270427",
        "大頭貼": "797",
        "封面照": "風景(76).jpg",
        "自我介紹": "Stay strong",
        "地區": "台中",
        "職業": "自由工作者",
        "學校": "台中科技大學",
        "粉絲專頁1": "台中科技大學",
    },
    {
        "編號": "798",
        "手機號碼": "0902-250484",
        "姓名": "簡玉玲",
        "拼音": "Jian Yuling",
        "生日": "1996-10-24",
        "年紀": "25",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "jianyuling1997",
        "密碼(拼音第一位+生日4碼重複2次)": "j10241024",
        "大頭貼": "798",
        "封面照": "風景(77).jpg",
        "自我介紹": "著名奶茶鑑定家",
        "地區": "台北",
        "職業": "研究生",
        "學校": "輔仁大學",
        "粉絲專頁1": "輔仁大學",
    },
    {
        "地區": "高雄",
        "職業": "社群小編",
        "學校": "高雄大學",
        "粉絲專頁1": "高雄大學",
    },
    {
        "地區": "新北",
        "職業": "動畫設計師",
        "學校": "龍華科技大學",
        "粉絲專頁1": "龍華科技大學",
    },
    {
        "編號": "801",
        "手機號碼": "0902-204301",
        "姓名": "黃詩媛",
        "拼音": "Huang Shiyuan",
        "生日": "1984-01-25",
        "年紀": "36",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "huangshiyuan1984",
        "密碼(拼音第一位+生日4碼重複2次)": "h01250125",
        "大頭貼": "801",
        "封面照": "風景(80).jpg",
        "自我介紹": "為自己而進步，而不是為了滿足誰 討好誰",
        "地區": "台中",
        "職業": "採購人員",
        "學校": "台中教育大學",
        "粉絲專頁1": "台中教育大學",
    },
    {
        "編號": "802",
        "手機號碼": "0902-204302",
        "姓名": "童昱翔",
        "拼音": "Tong Yuxiang",
        "生日": "1974-05-04",
        "年紀": "46",
        "性別": "男",
        "帳號 (拼音+ 出生西元年份)": "tongyuxiang1974",
        "大頭貼": "802",
        "封面照": "風景(81).jpg",
        "職業": "助理"
    },
    {
        "編號": "803",
        "手機號碼": "0902-204303",
        "姓名": "郝偉婷",
        "拼音": "Hao Weiting",
        "生日": "1967-10-31",
        "年紀": "53",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "haoweiting1967",
        "大頭貼": "803",
        "封面照": "風景(82).jpg",
        "職業": "品酒師"
    },
    {
        "編號": "804",
        "手機號碼": "0902-204304",
        "姓名": "韓怡雯",
        "拼音": "Han Yiwen",
        "生日": "1987-12-18",
        "年紀": "33",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "hanyiwen1987",
        "大頭貼": "804",
        "封面照": "風景(83).jpg",
        "職業": "藝術家"
    },
    {
        "編號": "805",
        "手機號碼": "0902-204305",
        "姓名": "林雅筑",
        "拼音": "Lin Yazhu",
        "生日": "1970-03-25",
        "年紀": "50",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "linyazhu1970",
        "大頭貼": "805",
        "封面照": "風景(84).jpg",
        "職業": "自由工作者"
    },
    {
        "編號": "806",
        "手機號碼": "0902-204306",
        "姓名": "馮意韻",
        "拼音": "Feng Yiyun",
        "生日": "2000-09-23",
        "年紀": "20",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "fengyiyun2000",
        "大頭貼": "806",
        "封面照": "風景(85).jpg",
        "職業": "財務經理"
    },
    {
        "編號": "807",
        "手機號碼": "0902-204307",
        "姓名": "陳衛植",
        "拼音": "Chen Weizhi",
        "生日": "1972-12-02",
        "年紀": "48",
        "性別": "男",
        "帳號 (拼音+ 出生西元年份)": "chenweizhi1972",
        "大頭貼": "807",
        "封面照": "風景(86).jpg",
        "職業": "公關經理"
    },
    {
        "編號": "808",
        "手機號碼": "0902-204308",
        "姓名": "黃靜恆",
        "拼音": "Huang Jingheng",
        "生日": "1965-02-14",
        "年紀": "55",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "huangjingheng1965",
        "大頭貼": "808",
        "封面照": "風景(87).jpg",
        "職業": "倉儲人員"
    },
    {
        "編號": "809",
        "手機號碼": "0902-204309",
        "姓名": "許志祥",
        "拼音": "Xu Zhixiang",
        "生日": "1996-05-30",
        "年紀": "24",
        "性別": "男",
        "帳號 (拼音+ 出生西元年份)": "xuzhixiang1996",
        "大頭貼": "809",
        "封面照": "風景(88).jpg",
        "職業": "打雜工"
    },
    {
        "編號": "810",
        "手機號碼": "0902-204311",
        "姓名": "王德年",
        "拼音": "Wang denian",
        "生日": "1993-06-29",
        "年紀": "28",
        "性別": "男",
        "帳號 (拼音+ 出生西元年份)": "wangdenian1975",
        "大頭貼": "810",
        "封面照": "風景(89).jpg",
        "職業": "品酒師"
    },
    {
        "編號": "811",
        "手機號碼": "0902-204312",
        "姓名": "陳姿宮",
        "拼音": "Chen Zigong",
        "生日": "1997-09-19",
        "年紀": "33",
        "性別": "女",
        "帳號 (拼音+ 出生西元年份)": "chenzigong1967",
        "大頭貼": "811",
        "封面照": "風景(90).jpg",
        "職業": "鏟屎官"
    }
]
}
{
    "951": [
    {
        "undefined": "帳號連結",
        "個資": "姓名",
        "人設": "大頭貼",
        "學校": "粉絲專頁1",
        "市長": "粉絲專頁2",
        "新聞": "粉絲專頁3",
        "youtuber": "粉絲專頁4",
        "歌手": "粉絲專頁4",
        "貼文1": "圖片",
        "貼文2": "文字",
        "完成": "IG",
        "養護": "加好友"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100025626326039",
        "個資": "顏宜珊",
        "人設": "A_1.jpg",
        "學校": "臺北科技大學",
        "youtuber": "波特王",
        "歌手": "ELLE",
    },
    {
        "學校": "高雄餐飲",
        "youtuber": "毛毛蟲網路繪本",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100065448932398",
        "個資": "邱成印",
        "人設": "A_7.jpg",
        "學校": "宏國德霖科技大學",
        "youtuber": "TEEPR 叭啦叭啦研究室",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100068741383121",
        "個資": "吳秀珍",
        "人設": "A_8.jpg",
        "學校": "醒吾科技大學",
        "youtuber": "技安chi an",
    },
    {
        "學校": "台中科技大學",
        "youtuber": "社畜時代",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100069461474991",
        "個資": "徐盈岑",
        "人設": "B_11.jpg",
        "學校": "高雄科技大學",
        "youtuber": "老王",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100071237540533",
        "個資": "林宗昆",
        "人設": "B_12.jpg",
        "學校": "臺北科技大學",
        "youtuber": "這群人",
        "歌手": "五月天",
    },
    {
        "undefined": "帳號停用",
        "個資": "楊佳瑩",
        "人設": "B_13.jpg",
        "學校": "文化大學",
        "youtuber": "安啾 Anjou",
    },
    {
        "undefined": "帳號停用",
        "個資": "陳貴義",
        "人設": "B_14.jpg",
        "學校": "中興大學",
        "youtuber": "U beauty",
    },
    {
        "undefined": "帳號停用",
        "個資": "賴玉婷",
        "人設": "B_15.jpg",
        "學校": "國立高雄師範大學",
        "youtuber": "小三美日平價美妝",
        "歌手": "周興哲",
        "完成": "x"
    },
    {
        "undefined": "帳號停用",
        "個資": "張宗翰",
        "人設": "B_16.jpg",
        "學校": "聖約翰科技大學",
        "youtuber": "妞新聞",
        "歌手": "周杰倫",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100071239944920",
        "個資": "林依雨",
        "人設": "B_17.jpg",
        "學校": "淡江大學\r\n",
        "youtuber": "Beauty美人圈",
        "歌手": "梁靜茹",
    },
    {
        "學校": "逢甲大學",
        "youtuber": "噪咖",
        "歌手": "蔡依林",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100069945381433",
        "個資": "韓與妹",
        "人設": "B_19.jpg",
        "學校": "高雄大學",
        "youtuber": "A Designer",
        "歌手": "兄弟本色",
        "貼文1": "旅行1",
        "貼文2": "台灣最速男楊俊瀚跑出10秒21",
        "完成": "x審查"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100064577493637",
        "個資": "王毓琪",
        "人設": "B_20.jpg",
        "學校": "臺北科技大學",
        "youtuber": "Circle",
        "歌手": "蕭敬騰",
        "貼文1": "天空2.jpg",
        "貼文2": "依瑟儂小戴好交情喊話:你一定要贏到最後",
        "完成": "v"
    },
    {
        "學校": "文化大學",
        "youtuber": "賴珮如Vino",
        "歌手": "吳青峰",
        "貼文1": "投資1.jpeg",
        "貼文2": "龜兔賽跑? 牙買加女飛人 200公尺預賽爆冷出局",
        "完成": "v"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100065502187773",
        "個資": "楊昇育",
        "人設": "C_12.jpg",
        "學校": "台中教育大學",
        "youtuber": "波蘭女孩x台灣男孩 在家環遊世界",
        "歌手": "Bii 畢書盡",
    },
    {
        "undefined": "帳號停用",
        "個資": "林麗秀",
        "人設": "C_13.jpg",
        "學校": "高雄餐飲",
        "youtuber": "True Yoga Fitness 全真瑜珈健身",
        "歌手": "李榮浩",
        "貼文1": "畫1.jpg",
        "貼文2": "1500米跌倒照樣第一",
        "完成": "x"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100068256256356",
        "個資": "陳家豪",
        "人設": "C_14.jpg",
        "學校": "德明財經科技大學",
        "youtuber": "PeiFen李佩芬",
        "歌手": "孫燕姿",
        "貼文1": "旅行2",
        "貼文2": "黃筱雯為拳擊奪第一面牌",
        "完成": "v"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100071159815106",
        "個資": "金怡璇",
        "人設": "C_15.jpg",
        "學校": "景文科技大學",
        "youtuber": "齊柏林的飛閱台灣",
        "歌手": "張學友",
        "貼文1": "上班2.jpg",
        "貼文2": "唐嘉鴻體操全能成績歷史第七",
        "完成": "v"
    },
    {
        "個資": "錢嘉義",
        "undefined": "台中科技大學",
        "人設": "C_16.jpg",
        "學校": "台中科技大學",
        "youtuber": "拉近文化",
        "歌手": "吳克群"
    },
    {
        "學校": "義守大學",
        "歌手": "那英"
    },
    {
        "個資": "黃百堯",
        "undefined": "世新大學",
        "人設": "C_18.jpg",
        "學校": "世新大學",
        "歌手": "劉德華"
    },
    {
        "個資": "魏瓊安",
        "undefined": "真理大學",
        "人設": "C_19.jpg",
        "學校": "真理大學",
        "歌手": "莫文蔚"
    },
    {
        "個資": "王書論",
        "undefined": "台中教育大學",
        "人設": "C_20.jpg",
        "學校": "台中教育大學",
        "youtuber": "ButyBox 美妝體驗網",
        "歌手": "費玉清"
    },
    {
        "個資": "陳怡萱",
        "undefined": "高雄科技大學",
        "人設": "D_6.jpg",
        "youtuber": "東海岸大地藝術節",
        "歌手": "周華健"
    },
    {
        "個資": "林逸群",
        "youtuber": "The Biologist Apprentice",
        "歌手": "林憶蓮"
    },
    {
        "個資": "蕭雯蓁",
        "undefined": "新北",
        "人設": "D_8.jpg",
        "youtuber": "Wow愛美食",
        "歌手": "李宗盛"
    },
    {
        "youtuber": "楊桃美食網",
        "歌手": "黃家駒"
    },
    {
        "個資": "陳雅茱",
        "youtuber": "台灣美食旅遊任我行",
        "歌手": "江蕙"
    },
    {
        "個資": "蘇廷然",
        "undefined": "再苦再累，只要堅持往前走，屬於你的風景終會出現",
        "人設": "D_11.jpg"
    }
]
}
{
    "851": [
    {
        "undefined": "帳號連結",
        "個資": "姓名",
        "人設": "大頭貼",
        "學校": "粉絲專頁1",
        "市長": "粉絲專頁2",
        "新聞": "粉絲專頁3",
        "歌手": "粉絲專頁4",
        "貼文 1": "圖片",
        "貼文 2 奧運": "文字",
        "完成": "日期",
        "養護": "加好友"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100069668351279",
        "個資": "許芃荷",
        "人設": "A_1.jpg",
        "學校": "臺北科技大學",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100067524339321",
        "個資": "陳盈甄",
        "人設": "A_2.jpg",
        "學校": "文化大學觀光系所",
    },
    {
        "學校": "逢甲大學",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100024874796649",
        "個資": "何舒彗",
        "人設": "A_4.jpg",
        "學校": "正修科技大學CSU",
        "市長": "陳其邁 Chen Chi-Mai",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100070867972560",
        "個資": "王靜怡",
        "人設": "B_1.jpg",
        "學校": "國立高雄科技大學 National Kaohsiung University of Science and Technology",
    },
    {
        "學校": "國立中興大學 National Chung Hsing University",
        "歌手": "OZI",
        "貼文 1": "上班1.jpg",
        "貼文 2 奧運": "韓系單眼皮歐巴 台灣蝶王冠閎",
        "完成": "8/3"
    },
    {
        "學校": "高雄餐飲",
    },
    {
        "學校": "德明財經科技大學",
    },
    {
        "學校": "景文科技大學",
    },
    {
        "學校": "台中科技大學",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100064401630913",
        "個資": "王癸玉",
        "人設": "B_7.jpg",
        "學校": "國立高雄師範大學 National Kaohsiung Normal University",
        "市長": "陳其邁 Chen Chi-Mai",
        "歌手": "周興哲 Eric Chou",
        "貼文 1": "植物2.jpg",
        "貼文 2 奧運": "美鉛球女將X手勢惹議",
        "完成": "8/5"
    },
    {
        "學校": "就讀國立臺北大學National Taipei University",
        "歌手": "周杰倫 Jay Chou",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100068124915928",
        "個資": "張嬌芬",
        "人設": "B_9.jpg",
        "學校": "東南科技大學",
        "歌手": "梁靜茹 Fish Leong",
        "貼文 1": "上班7.jpg",
        "貼文 2 奧運": "球王殺手茲維瑞夫 勇奪網球金牌",
        "完成": "8/5"
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100071037205693",
        "個資": "王聖華",
        "人設": "B_10.jpg",
        "學校": "大葉大學 Da-Yeh University",
        "歌手": "蔡依林 Jolin Tsai",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100066138339843",
        "個資": "李景珊",
        "人設": "C_1.jpg",
        "學校": "國立高雄大學 National University of Kaohsiung",
        "市長": "陳其邁 Chen Chi-Mai",
    },
    {
        "學校": "中國科技大學 China University of Technology",
        "歌手": "蕭敬騰 Jam Hsiao",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100070049362131",
        "個資": "李慧筑",
        "人設": "C_3.jpg",
        "學校": "明志科技大學",
        "歌手": "吳青峰",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100071279196610",
        "個資": "吳哲維",
        "人設": "C_4.jpg",
        "學校": "國立臺中科技大學 National Taichung University of Science and Technology",
        "歌手": "Bii 畢書盡",
    },
    {
        "undefined": "https://www.facebook.com/profile.php?id=100067386283813",
        "個資": "蔡竣芳",
        "人設": "C_5.jpg",
        "學校": "義守大學",
        "歌手": "李榮浩",
        "貼文 1": "上班5.jpg",
        "貼文 2 奧運": "體操女王村上茉愛撞臉蔡依林",
        "完成": "8/5"
    },
    {
        "個資": "曾明杰",
        "歌手": "張學友",
    },
    {
        "undefined": "https://udn.com/news/story/122349/5649521?from=udn-catelistnews_ch2",
        "個資": "錢怡君",
        "人設": "C_7.jpg",
        "歌手": "孫燕姿",
        "貼文 2 奧運": "12歲奪滑板銀牌"
    },
    {
        "歌手": "吳克群",
        "貼文 2 奧運": "日小鮮肉奪滑板金牌 22歲坐擁500坪豪宅"
    },
    {
        "undefined": "https://www.hk01.com/%E5%8D%B3%E6%99%82%E9%AB%94%E8%82%B2/658679/%E6%9D%B1%E4%BA%AC%E5%A5%A7%E9%81%8B-%E5%A5%B3%E5%A3%AB%E5%BF%85%E7%9C%8B-%E8%82%8C%E8%82%89%E7%94%B7%E7%A5%9E%E4%B9%8B%E7%AA%9F-%E9%81%8B%E5%8B%95%E6%94%80%E7%99%BB%E6%A5%B5%E5%93%81-%E5%B0%8F%E9%AE%AE%E8%82%89-%E6%8C%87%E5%8D%97",
        "個資": "楊佩璇",
        "人設": "C_9.jpg",
        "歌手": "那英",
        "貼文 1": "生活6",
        "貼文 2 奧運": "女生必看 東奧攀登小鮮肉"
    },
    {
        "undefined": "https://news.pts.org.tw/article/538346",
        "個資": "黃羽雄",
        "人設": "C_10.jpg",
        "歌手": "劉德華",
        "貼文 2 奧運": "巴西選手奪金 故鄉掀衝浪熱潮"
    },
    {
        "個資": "王雅文",
        "人設": "D_1.jpg",
        "歌手": "莫文蔚",
    },
    {
        "歌手": "費玉清",
    },
    {
        "undefined": "https://sports.ltn.com.tw/news/breakingnews/3616223",
        "個資": "黃佳慧",
        "人設": "D_3.jpg",
        "歌手": "周華健",
        "貼文 1": "咖啡",
        "貼文 2 奧運": "鐵人三項烏龍 大會船隻擋路"
    },
    {
        "undefined": "https://udn.com/news/story/122349/5640705",
        "個資": "陳彥華",
        "人設": "D_4.jpg",
        "歌手": "林憶蓮",
        "貼文 2 奧運": "三鐵英摘金美鍍銀"
    },
    {
        "歌手": "李宗盛",
        "歌手": "黃家駒",
    },
    {
        "歌手": "江蕙",
        "貼文 1": "陶藝品"
    }
]
}